# Concatenate, Merge, Join

## Objectives

- Explore and understand various database-like operations available in Pandas, including concatenation, merging, and joining of DataFrames.
- Learn to apply these operations to manipulate and combine data efficiently.

## Background

This notebook demonstrates how to perform database-like operations in Pandas, akin to SQL, focusing on concatenating, merging, and joining DataFrames to manipulate datasets effectively.

## Datasets Used

The notebook does not reference external datasets.

## Concatenate

In [1]:
import numpy as np
import pandas as pd

In this example, we take three DataFrames with similar column names and concatenate them using the concat() function.

In [2]:
df1 = pd.DataFrame({'A':[0, 1, 2], 'B':[0, 1, 2], 'C':[0, 1, 2]}, index=[0, 1, 2])
df1

   A  B  C
0  0  0  0
1  1  1  1
2  2  2  2

In [3]:
df2 = pd.DataFrame({'A': [3, 4, 5, 6], 'B': [3, 4, 5, 6], 'C': [3, 4, 5, 6]}, index=[3, 4, 5, 6])
df2

   A  B  C
3  3  3  3
4  4  4  4
5  5  5  5
6  6  6  6

In [4]:
df3 = pd.DataFrame({'A': [7, 8, 9], 'B': [7, 8, 9], 'C': [7, 8, 9]}, index=[7, 8, 9])
df3

   A  B  C
7  7  7  7
8  8  8  8
9  9  9  9

Concatenating dataframes

In [5]:
# concatenating dataframes
frames = [df1, df2, df3]
res = pd.concat(frames)

In [6]:
print(res.shape)
res

(10, 3)

   A  B  C
0  0  0  0
1  1  1  1
2  2  2  2
3  3  3  3
4  4  4  4
5  5  5  5
6  6  6  6
7  7  7  7
8  8  8  8
9  9  9  9

Getting a hierarchical index

In [7]:
res1 = pd.concat(frames,  keys=['a', 'b', 'c'])
res1

     A  B  C
a 0  0  0  0
  1  1  1  1
  2  2  2  2
b 3  3  3  3
  4  4  4  4
  5  5  5  5
  6  6  6  6
c 7  7  7  7
  8  8  8  8
  9  9  9  9

Accessing the dataframe by index `'c'`

In [8]:
res1.loc['c']

   A  B  C
7  7  7  7
8  8  8  8
9  9  9  9

Accessing the dataframe by index `['c', 9]`

In [9]:
res1.loc['c', 9]

A    9
B    9
C    9
Name: (c, 9), dtype: int64

We take two DataFrames with similar indexes and concatenate them using the `concat()` function.

In [10]:
df4 = pd.DataFrame({'E': [1, 2, 3, 5], 'F': [1, 2, 3, 5]}, index=[1, 2, 3, 5])
df4

   E  F
1  1  1
2  2  2
3  3  3
5  5  5

By default, concatenation is performed using `axis=0`

In [11]:
pd.concat([df1, df4])

     A    B    C    E    F
0  0.0  0.0  0.0  NaN  NaN
1  1.0  1.0  1.0  NaN  NaN
2  2.0  2.0  2.0  NaN  NaN
1  NaN  NaN  NaN  1.0  1.0
2  NaN  NaN  NaN  2.0  2.0
3  NaN  NaN  NaN  3.0  3.0
5  NaN  NaN  NaN  5.0  5.0

Notice the missing values are filled with `NaN`

Using the second axis `(axis=1)`

In [12]:
res2 = pd.concat([df1, df4], axis=1)
res2

     A    B    C    E    F
0  0.0  0.0  0.0  NaN  NaN
1  1.0  1.0  1.0  1.0  1.0
2  2.0  2.0  2.0  2.0  2.0
3  NaN  NaN  NaN  3.0  3.0
5  NaN  NaN  NaN  5.0  5.0

In [13]:
res2.reset_index()

   index    A    B    C    E    F
0      0  0.0  0.0  0.0  NaN  NaN
1      1  1.0  1.0  1.0  1.0  1.0
2      2  2.0  2.0  2.0  2.0  2.0
3      3  NaN  NaN  NaN  3.0  3.0
4      5  NaN  NaN  NaN  5.0  5.0

Removing the index column

In [14]:
res2.reset_index(drop=True)

     A    B    C    E    F
0  0.0  0.0  0.0  NaN  NaN
1  1.0  1.0  1.0  1.0  1.0
2  2.0  2.0  2.0  2.0  2.0
3  NaN  NaN  NaN  3.0  3.0
4  NaN  NaN  NaN  5.0  5.0

The following examples show how to execute something equivalent to an INNER JOIN between two database tables. In this case, it will involve two DataFrames.

`join = 'inner'` produces the following result:

In [15]:
pd.concat([df1, df4], axis=1, join='inner')

   A  B  C  E  F
1  1  1  1  1  1
2  2  2  2  2  2

You only get the rows belonging to both DataFrames.

If you do not specify `join = 'inner'`, you get a bigger DataFrame (equivalent to a SQL CROSS JOIN). Notice that missing values are filled with NaN.

In [16]:
pd.concat([df1, df4])

     A    B    C    E    F
0  0.0  0.0  0.0  NaN  NaN
1  1.0  1.0  1.0  NaN  NaN
2  2.0  2.0  2.0  NaN  NaN
1  NaN  NaN  NaN  1.0  1.0
2  NaN  NaN  NaN  2.0  2.0
3  NaN  NaN  NaN  3.0  3.0
5  NaN  NaN  NaN  5.0  5.0

`outer` is the default option for the parameter join

In [17]:
pd.concat([df1, df4], join='outer')

     A    B    C    E    F
0  0.0  0.0  0.0  NaN  NaN
1  1.0  1.0  1.0  NaN  NaN
2  2.0  2.0  2.0  NaN  NaN
1  NaN  NaN  NaN  1.0  1.0
2  NaN  NaN  NaN  2.0  2.0
3  NaN  NaN  NaN  3.0  3.0
5  NaN  NaN  NaN  5.0  5.0

Using `axis=1` the join will create a dataframe with unique rows from df1 and df2, but with all the columns from both.

In [18]:
pd.concat([df1, df4], axis=1, join='outer')

     A    B    C    E    F
0  0.0  0.0  0.0  NaN  NaN
1  1.0  1.0  1.0  1.0  1.0
2  2.0  2.0  2.0  2.0  2.0
3  NaN  NaN  NaN  3.0  3.0
5  NaN  NaN  NaN  5.0  5.0

## Merge

The different types of join or merge in Pandas:
- `inner join`: To keep only rows from both DataFrames, specify how=‘inner’.
- `outer join` or full outer join: To keep all rows from both data frames, specify how=‘outer’.
- `left  join` or left outer join: To include all the rows of your data frame x and only those from y that match, specify how=‘left’.
- `right join` or right outer join: To include all the rows of your data frame y and only those from x that match, specify how=‘right’.

![image info](./Merge.png)

In [19]:
d1 = {
            'Customer_id': pd.Series([1, 2, 3, 4, 5, 6]),
            'Product': pd.Series(['Radio', 'Radio', 'Radio', 'Television', 'Television', 'Television'])
     }
df1 = pd.DataFrame(d1)
df1

   Customer_id     Product
0            1       Radio
1            2       Radio
2            3       Radio
3            4  Television
4            5  Television
5            6  Television

In [20]:
d2 = {
        'Customer_id': pd.Series([2, 4, 6, 8, 10]),
        'State': pd.Series(['Nevada', 'Nevada', 'Texas', 'Florida', 'Florida'])
    }
df2 = pd.DataFrame(d2)
df2

   Customer_id    State
0            2   Nevada
1            4   Nevada
2            6    Texas
3            8  Florida
4           10  Florida

**Inner Join**

In [21]:
#inner join 
pd.merge(df1, df2, on='Customer_id', how='inner')

   Customer_id     Product   State
0            2       Radio  Nevada
1            4  Television  Nevada
2            6  Television   Texas

**Outer Join**

In [22]:
# outer join 
pd.merge(df1, df2, on='Customer_id', how='outer')

   Customer_id     Product    State
0            1       Radio      NaN
1            2       Radio   Nevada
2            3       Radio      NaN
3            4  Television   Nevada
4            5  Television      NaN
5            6  Television    Texas
6            8         NaN  Florida
7           10         NaN  Florida

**Left Join**

In [23]:
# left join 
pd.merge(df1, df2, on='Customer_id', how='left')

   Customer_id     Product   State
0            1       Radio     NaN
1            2       Radio  Nevada
2            3       Radio     NaN
3            4  Television  Nevada
4            5  Television     NaN
5            6  Television   Texas

**Right Join**

In [24]:
# right join 
pd.merge(df1, df2, on='Customer_id', how='right')

   Customer_id     Product    State
0            2       Radio   Nevada
1            4  Television   Nevada
2            6  Television    Texas
3            8         NaN  Florida
4           10         NaN  Florida

## Join

It is a method that joins standard fields of various DataFrames.

The df.join() method join columns with other DataFrame either on an index or on a key column.

`DataFrame.join()` is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

For simplicity, matching will use only the index, but `join` also allows to define the matching column using `on` as before. Also, the matching columns can have different names and it is possible to use something like `on=['ID', 'CustomerID']`.

In [25]:
left = pd.DataFrame(
    {
        'Col_A': ['A0', 'A1', 'A2'],
        'Col_B': ['B0', 'B1', 'B2']
    },
    index=['a', 'b', 'c']
)
left

  Col_A Col_B
a    A0    B0
b    A1    B1
c    A2    B2

In [26]:
right = pd.DataFrame(
    {
        'Col_C': ['C0', 'C1', 'C2'],
        'Col_D': ['D0', 'D1', 'D2']
    },
    index=['a', 'c', 'd']
)
right

  Col_C Col_D
a    C0    D0
c    C1    D1
d    C2    D2

In [27]:
# left join (rows from left dataframe and matching rows from right dataframe)
left.join(right)

  Col_A Col_B Col_C Col_D
a    A0    B0    C0    D0
b    A1    B1   NaN   NaN
c    A2    B2    C1    D1

In [28]:
# rows from right dataframe and matching rows from left dataframe
right.join(left)

  Col_C Col_D Col_A Col_B
a    C0    D0    A0    B0
c    C1    D1    A2    B2
d    C2    D2   NaN   NaN

In [29]:
# inner join between both dataframes (only rows with matching index values are returned)
left.join(right, how='inner')

  Col_A Col_B Col_C Col_D
a    A0    B0    C0    D0
c    A2    B2    C1    D1

In [30]:
# the same as above, but with the order of dataframes reversed (right columns come first)
right.join(left, how='inner')

  Col_C Col_D Col_A Col_B
a    C0    D0    A0    B0
c    C1    D1    A2    B2

A more practical example using MERGE to show how to process orders with items (products in the order).

`Orders` will only have two columns, the unique `ID` and its `timestamp`.

`ItemsByOrders` will have several columns: `OrderID` (order it belongs to), `Idx` (item number in the order), `Product` (the product name), and `Price` (the product price).

The goal will be to get a dataframe with all the information about the order, including each ordered product with its price.

Notice that a real-world design should use a ProductID to get its name and price, and that it should be unique in the order, using a column Quantity in case the order has more than one.

In [31]:
# Create the orders DataFrame
orders = pd.DataFrame(
    {
        'ID': [1, 2, 3, 4],
        'timestamp': ['2024-06-01 12:34', '2024-06-02 15:20', '2024-06-03 08:50', '2024-06-04 10:10']
    }
)
orders

   ID         timestamp
0   1  2024-06-01 12:34
1   2  2024-06-02 15:20
2   3  2024-06-03 08:50
3   4  2024-06-04 10:10

In [32]:
# Create the itemsByOrder DataFrame
itemsByOrder = pd.DataFrame(
    {
        'OrderID': [1, 1, 2, 3, 5],
        'Idx': [1, 2, 1, 1, 1],
        'Product': ['Widget', 'Gadget', 'Sticker', 'Baloon', 'Helium'],
        'Price': [19.99, 29.99, 19.99, 24.99, 9.99]
    }
)
itemsByOrder

   OrderID  Idx  Product  Price
0        1    1   Widget  19.99
1        1    2   Gadget  29.99
2        2    1  Sticker  19.99
3        3    1   Baloon  24.99
4        5    1   Helium   9.99

In [33]:
# Perform a left join
merged_df = pd.merge(orders, itemsByOrder, how='left', left_on='ID', right_on='OrderID')
merged_df

   ID         timestamp  OrderID  Idx  Product  Price
0   1  2024-06-01 12:34      1.0  1.0   Widget  19.99
1   1  2024-06-01 12:34      1.0  2.0   Gadget  29.99
2   2  2024-06-02 15:20      2.0  1.0  Sticker  19.99
3   3  2024-06-03 08:50      3.0  1.0   Baloon  24.99
4   4  2024-06-04 10:10      NaN  NaN      NaN    NaN

Obviously, order with ID=4 was never finished because it is empty (it has no products)

In [34]:
# The correct join should be inner (we only want orders that have items)
merged_df = pd.merge(orders, itemsByOrder, how='inner', left_on='ID', right_on='OrderID')
merged_df

   ID         timestamp  OrderID  Idx  Product  Price
0   1  2024-06-01 12:34        1    1   Widget  19.99
1   1  2024-06-01 12:34        1    2   Gadget  29.99
2   2  2024-06-02 15:20        2    1  Sticker  19.99
3   3  2024-06-03 08:50        3    1   Baloon  24.99

Now we can print the total Price for all completed orders.

In [35]:
for order_id in merged_df['OrderID'].unique():
    print(f'Total price for order {order_id}: {merged_df[merged_df["OrderID"] == order_id].Price.sum()}')

Total price for order 1: 49.98
Total price for order 2: 19.99
Total price for order 3: 24.99

## Conclusions

Key Takeaways:
- Concatenation allows for straightforward vertical and horizontal dataset combinations, supporting hierarchical indexing for more complex data structures.
- Merge operations enable SQL-like joins on DataFrames, including inner, outer, left, and right joins, providing flexibility in combining datasets based on common columns.
- The join method intuitively combines DataFrames based on index alignment, supporting inner and outer joins and facilitating data integration from multiple sources.

## References

- VanderPlas, J. (2017) Python Data Science Handbook: Essential Tools for Working with Data. USA: O’Reilly Media, Inc. chapter 3